app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 2], ["created_at", "2019-04-25 00:07:17.867634"], ["updated_at", "2019-04-25 00:07:17.867634"]]
---
  def create
    share = ArtworkShare.new(share_params)

    if share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]
---
  def destroy
    share = ArtworkShare.find_by_id(params[:id])

    if share.destroy