app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
---
  def index
    if params.key?(:user_id)
      render json: User.find_by_id(params[:user_id]).comments
    else
      render json: Artwork.find_by_id(params[:artwork_id]).comments

INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["artwork_id", 2], ["body", "Test comment"], ["created_at", "2019-04-25 23:46:30.290362"], ["updated_at", "2019-04-25 23:46:30.290362"]]
---
  def create
    comment = Comment.new(comment_params)

    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]
---
  def destroy
    comment = Comment.find_by_id(params[:id])
    if comment.destroy