app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "frodo"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
    users = nil
    if params.include?(:name)
      users = User.where('UPPER(username) LIKE UPPER(?)', "%#{params[:name]}%")
    else
      users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    user = User.find_by_id(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Frodos"], ["updated_at", "2019-04-24 23:21:19.384399"], ["id", 2]]
---
  def update
    user = User.find_by_id(params[:id])

    if user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
  def destroy
    user = User.find_by_id(params[:id])
    if user.destroy